class BotService {
 
    deleteRoomByIdRoom(rooms, idRoom) {
        const indexRoom = rooms.findIndex(el => el.idRoom === idRoom);
        
        if(indexRoom !== -1) {
            const room = rooms[indexRoom];
            rooms.splice(indexRoom, 1);

            return room;
        }

        return false;
    }

    getInfo(ctx) { 
        ctx.reply(`Для того щоб почати гру, додайте цього бота в групу в якій знаходяться ваші друзі, також всі учасники гри повинні додати собі цього бота (прописати в ньому /start) потім ви зможете почати гру
        Команди:
        Покинути гру - /leavegame (писати самому боту)
        Почати гру - /game (писати в групі)
        Завершити гру - /endgame (писати в групі)
        Приєднатися до гри - /joingame (писати в групі)
        Інформація про кошти - /balance (писати самому боту)
        Наступне коло - /next (писати в групі)
        Інформація про бізнес - /business
        Інформація про нерухомість - /realEstate

        Хід гри. 
        Після того, як ви додасте бота до чату і напишите команду /game - почнеться гра.
        Бот на кожному крузі буте відсилати вам певні івенти. На деякі треба відповісти (/yes, /no), а деякі пройдуть автоматично.
        Після того як корисувачі зроблять свій хід (відповідь /yes /no. Деякі івенти виконуються автоматично), їм буде доступна команда /next (у чаті) і коли всі гравці її виконають -
        вони перейдуть на наступне коло та отримують прибуток від безнесів/нерухомості 
        Всього в грі 15 раундів, але в будь-який момент її можна завершити, якщо виконати команду /endgame (або якщо гравець вийде і без нього їх буде не достатньо, тоді гра завершиться)
        Перемагає той, у кого капіталу в сумі більше. Гарної гри !     
        `);
    }

    existUserInAnotherGameIndex(rooms, userId) {
        const existUserInAnotherGame = rooms.findIndex(el => {
            return el.users.find(el => el.user === userId)
        });

        return existUserInAnotherGame;
    }
}

module.exports = { BotService };
